using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using System;
[Serializable]
public class jikidata_json
{
    public int _jiki;
    public bool _sound;
    //上位の記録
    public int[] materialnum= {0,1,2,3,4 ,255,255,255,255,255,255,255};
    public int[] R = {100,255,0,0,255,0,255,255,255,255,255,255,255};
    public int[] G = {100,0,0,255,255,0 ,255,255,255,255,255,255,255};
    public int[] B = {255,0,255,255,0 ,255,255,255,255,255,255,255};
    public int[] A = { 255, 255, 255, 255, 255,255,255,255,255,255,255,255 };
    public string[] name= {"黄","赤","青","黒","白" ,"芝","藤","橙","灰","ピンク","森","深海","深紅","フリーモード背景色","サーモンピンク","土","セピア","雪","ニンジャ","歪み","逆三角", "四角", "富士山", "三角表示板", "トライアングル", "おにぎり", "日の丸", "エコマーク", "ペンローズの三角形", "シェルピンスキーのギャスケット","危険物" ,"超大型爆弾","レインボー" };//上位スコア,10件まで
    public string[] info= {"デフォルト","3倍速そう","涼しそう","プレイが困難","プレイが至難" ,"自然に優しい","高貴","凄い","中途半端","セクシー", "モリモリ点を稼ぎましょう", "なんて深いゲームなんだ",  "第五ドールではない","ステルス性抜群", "サーモンっておいしいよね","時には泥臭く","あの懐かしき日々よもう一度","雪を放つ","残像を出す　ナンデ！？","ぐにゃぁぁぁ","反骨精神の塊","枠にとらわれない", "／^o^＼", "車が故障した時に出すアレ","いい音がする","中身はおかか","がんばれニッポン","資源を大切に","不可能を可能にする","このゲームの元ネタ","画面が揺れる","プレイ画面が場外に消える","トライアングルマスターの勲章"};
    public int[] rarelity = { 0,60,60,40,40,60,60,60,40,40,60,60,60,40,60,60,0,0,0,0,10,10,10,20,20,10,20,20,20,20,40,40,0};
  //  public int[] rarelity = { 0, 0, 0, 0, 0, 0,0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
    //  public int[] rarelity = { 0, 00, 0, 0, 0, 30, 0, 0, 5, 0, 0, 0 };
    public int _yobi1;
    public int _yobi2;
    public int _yobi3;
    public int _yobi4;
}